{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 259
    },
    "1:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 31
    }
  },
  "questIDLow:4": 269,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "minecraft:entity.player.levelup",
      "taskLogic:8": "AND",
      "visibility:8": "ALWAYS",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "gregtech:gt.multitileentity",
        "Count:3": 1,
        "Damage:2": 27000,
        "OreDict:8": ""
      },
      "snd_update:8": "minecraft:entity.player.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "Early Automation - Shut Off",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "Now we can automate a shutoff since we have the temperature sensor.  You will need some red alloy wires which is crafted from red alloy plates and wire cutters.\n\nYou can use a screwdriver to change modes.  If you change to the \u0027Greater Than\u0027 mode, the temperature sensor will now output a redstone signal whenever it is above the set temperature.\nSet the desired temperature by right-clicking the buttons with an empty hand.  The crucible will turn yellow at 2400°K and will melt at 2500°K.\n\nNow place the piston in front and 2 blocks below your burning box, so that when it extends, the block above will be covering the front of the burning box. You can use a block of glass for the block on top of the piston so you can see if the burning box is still burning or not.  Since burning boxes need air in front of them to work, when the piston extends it will stop burning once the current fuel that is burning is consumed.\n\nNow connect the sensor with the piston, using the red alloy wire (you might want to use a wire cutter to make it easier).  It works similar to the pipes where the x in the grid shows which direction the wire is connecting.  Don\u0027t forget the vanilla Minecraft logic as a redstone signal going to a regular block (like stone) will transmit that signal to the adjacent sides of that block.  You can cuse this to your advantage.\n\nYou can connect a lever to the piston so you can manually trigger the piston to shutoff the burning box.  You can use a piece of paper as a cover to place a lever on the side or top of the wire.  Paper covers do not burn.  You can also use stone plates.\n\nDone, you now have an auto shutoff for your crucible with a possible manual shutoff.\n\nThere are multiple ways to build these systems.  One would be to have the piston on the side of the burning box and when the piston extends, it will block the burning box front.  You will be using these sensors and red alloy wires to do most of your automation including automatic crucibles.\n§b\nTip:  If you have not found a rubber tree or a slime ball to make the sticky piston, you can use sticky goo as a replacement.  Sticky Goo is made from some animal parts, just check NEI.  Sticky Goo is also good to make leads and a few other things.\n§a\n§c§4§\nCareful: a burning box will always finish burning it\u0027s current fuel item, that means it\u0027s best to use short burning time fuels like nuggets or tiny/small dusts. Make sure to have a buffer for your allowed temperature to accommodate for those extra delays!\n§a\nTo complete this quest craft:\n1 Sticky Piston\n4 Red Alloy Wires\n1 Lever\n"
    }
  },
  "tasks:9": {
    "0:10": {
      "partialMatch:1": 1,
      "autoConsume:1": 0,
      "groupDetect:1": 0,
      "ignoreNBT:1": 1,
      "index:3": 0,
      "consume:1": 0,
      "requiredItems:9": {
        "0:10": {
          "id:8": "minecraft:sticky_piston",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.multitileentity",
          "Count:3": 1,
          "Damage:2": 27000,
          "OreDict:8": ""
        },
        "2:10": {
          "id:8": "minecraft:lever",
          "Count:3": 1,
          "Damage:2": 0,
          "OreDict:8": ""
        }
      },
      "taskID:8": "bq_standard:retrieval"
    }
  },
  "rewards:9": {
    "0:10": {
      "rewardID:8": "bq_standard:choice",
      "index:3": 0,
      "choices:9": {
        "0:10": {
          "id:8": "gregtech:gt.multiitem.food",
          "Count:3": 1,
          "Damage:2": 2005,
          "OreDict:8": ""
        },
        "1:10": {
          "id:8": "gregtech:gt.multiitem.food",
          "Count:3": 1,
          "Damage:2": 2003,
          "OreDict:8": ""
        }
      }
    }
  }
}